Revit 2027 API
EnergyAnalysisConstruction.ConstructionName Property
 The name of the construction
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ConstructionName { get; }
Public ReadOnly Property ConstructionName As String
	Get
public:
property String^ ConstructionName {
	String^ get ();
}
member ConstructionName : string with get
Property Value
String
See Also
Reference
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace